app/views/recipes/show.html.erb

SELECT "wines".* FROM "wines" INNER JOIN "wine_recipes" ON "wines"."id" = "wine_recipes"."wine_id" WHERE "wine_recipes"."recipe_id" = ?  [["recipe_id", 4]]
---
<p><strong>Vinos To Pair With: </strong></p>
  <ul><% @recipe.wines.each do |wine| %>