app/views/users/show.html.erb

  <% else %>
    <ul><% @user.wines.each do |wine| %>
---
SELECT "wines".* FROM "wines" INNER JOIN "user_wines" ON "wines"."id" = "user_wines"."wine_id" WHERE "user_wines"."user_id" = ?  [["user_id", 2]]


<% if !@current_user.friendships.find_by(friend: @user) && @user != @current_user %>
---
SELECT  "friendships".* FROM "friendships" WHERE "friendships"."user_id" = ? AND "friendships"."friend_id" = 1 LIMIT ?  [["user_id", 6], ["LIMIT", 1]]