app/controllers/friendships_controller.rb

  def create
    @current_user = User.find(session[:user_id])
    @friendship = Friendship.find_or_create_by(user_id: @current_user.id, friend_id: params[:friend_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
INSERT INTO "friendships" ("user_id", "friend_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 6], ["friend_id", 1], ["created_at", "2017-12-28 20:13:52.631105"], ["updated_at", "2017-12-28 20:13:52.631105"]]
SELECT  "friendships".* FROM "friendships" WHERE "friendships"."user_id" = ? AND "friendships"."friend_id" = ? LIMIT ?  [["user_id", 6], ["friend_id", 1], ["LIMIT", 1]]

  def destroy
    @user = User.find(session[:user_id])
    byebug
    @friendship = @user.friendships.find_by(friend: params[:format])
    @friendship.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 38], ["LIMIT", 1]]
SELECT  "friendships".* FROM "friendships" WHERE "friendships"."user_id" = ? AND "friendships"."id" = ? LIMIT ?  [["user_id", 38], ["id", 37], ["LIMIT", 1]]
DELETE FROM "friendships" WHERE "friendships"."id" = ?  [["id", 1]]