app/controllers/recipes_controller.rb

  def index
  #index - all recipes
  #should have a search by feature
    @recipes = Recipe.all
    @user = User.find(session[:user_id])
---
SELECT "recipes".* FROM "recipes"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def show
    @recipe = Recipe.find(params[:id])
    @user = User.find(session[:user_id])
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def new
    #users (and admins) can add new wines
    @recipe = Recipe.new
    @difficult = Recipe.difficulty
    @wines = Wine.all
---
SELECT "wines".* FROM "wines"

  def create
    @recipe = Recipe.new(recipe_params)
    if @recipe.save
---
INSERT INTO "recipes" ("name", "difficult_level", "cost", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Chole"], ["difficult_level", "4"], ["cost", 19.0], ["created_at", "2017-12-26 17:44:34.977309"], ["updated_at", "2017-12-26 17:44:34.977309"]]

  def edit
    #only admins can edit
    @recipe = Recipe.find(params[:id])
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @recipe = Recipe.find(params[:id])
    if @recipe.update(recipe_params)
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "recipes" SET "difficult_level" = ?, "updated_at" = ? WHERE "recipes"."id" = ?  [["difficult_level", "4"], ["updated_at", "2017-12-26 16:53:48.624358"], ["id", 1]]