app/controllers/user_wines_controller.rb

  def create
    @user = User.find(session[:user_id])
    @userwine = @user.user_wines.find_or_create_by(wine_id: user_wine_params[:wine_id], rating: user_wine_params[:rating])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "user_wines" ("user_id", "wine_id", "created_at", "updated_at", "rating") VALUES (?, ?, ?, ?, ?)  [["user_id", 39], ["wine_id", 20], ["created_at", "2018-01-02 01:00:43.449109"], ["updated_at", "2018-01-02 01:00:43.449109"], ["rating", 5]]
SELECT  "user_wines".* FROM "user_wines" WHERE "user_wines"."user_id" = ? AND "user_wines"."wine_id" = ? AND "user_wines"."rating" = ? LIMIT ?  [["user_id", 39], ["wine_id", 20], ["rating", 5], ["LIMIT", 1]]
SELECT  "wines".* FROM "wines" WHERE "wines"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]

  def destroy
    @user = User.find(session[:user_id])
    @wine = Wine.find(params[:wine_id])
    @userwine = UserWine.find_by(user: @user, wine: @wine)
    @userwine.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "user_wines".* FROM "user_wines" WHERE "user_wines"."user_id" = 3 AND "user_wines"."wine_id" = 27 LIMIT ?  [["LIMIT", 1]]
SELECT  "wines".* FROM "wines" WHERE "wines"."id" = ? LIMIT ?  [["id", 27], ["LIMIT", 1]]
DELETE FROM "user_wines" WHERE "user_wines"."id" = ?  [["id", 2]]