app/controllers/users_controller.rb

  def index
    #index - all users
    #should have a search by feature
    @users = []
    if params[:search]
      @users = User.search(params[:search])
    end
    @user = User.find(session[:user_id])
---
SELECT "users".* FROM "users"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

  def show
    @current_user = User.find(session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def create
    @user = User.new(user_params)
    if @user.valid?
      @user.save
---
INSERT INTO "users" ("name", "username", "password_digest", "birthday", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def edit
    #only admins can edit
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]