app/controllers/wines_controller.rb

  def index
  #index - all wines
  #should have a search by feature
  # byebug
  @wines = Wine.all
  @user = User.find(session[:user_id])
---
SELECT "wines".* FROM "wines"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def show
    @wine = Wine.find(params[:id])
    @user = User.find(session[:user_id])

    if UserWine.find_by(wine: @wine, user: @user) && UserWine.find_by(wine: @wine, user: @user).rating != nil
---
SELECT  "user_wines".* FROM "user_wines" WHERE "user_wines"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT  "wines".* FROM "wines" WHERE "wines"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "user_wines".* FROM "user_wines" WHERE "user_wines"."wine_id" = 27 AND "user_wines"."user_id" = 5 LIMIT ?  [["LIMIT", 1]]
SELECT AVG("user_wines"."rating") FROM "user_wines" WHERE "user_wines"."wine_id" = 11

  def new
    #users (and admins) can add new wines
    @wine = Wine.new
    @recipes = Recipe.all
    @user = User.find(session[:user_id])
---
SELECT "recipes".* FROM "recipes"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def create
    @user = User.find(session[:user_id])
    @wine = Wine.new(wine_params)
    # @user_wine = UserWine.new(user: @user)

    if @wine.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "wines" ("name", "country", "year", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Another Malbec"], ["country", "France"], ["year", 1999], ["price", 39.0], ["created_at", "2017-12-26 17:26:20.173268"], ["updated_at", "2017-12-26 17:26:20.173268"]]

  def edit
    #only admins can edit
    @wine = Wine.find(params[:id])
    @recipes = Recipe.all
    @user = User.find(session[:user_id])
    @wine.user_wines.find_or_create_by(user: @user)
---
SELECT  "wines".* FROM "wines" WHERE "wines"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "recipes".* FROM "recipes"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "user_wines".* FROM "user_wines" WHERE "user_wines"."user_id" = ? AND "user_wines"."wine_id" = 3 LIMIT ?  [["user_id", 38], ["LIMIT", 1]]

  def update
    @recipes = Recipe.all
    @user = User.find(session[:user_id])
    @wine = Wine.find(params[:id])
    if @wine.update(wine_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "wines".* FROM "wines" WHERE "wines"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
SELECT "user_wines".* FROM "user_wines" WHERE "user_wines"."wine_id" = ?  [["wine_id", 8]]
UPDATE "user_wines" SET "rating" = ?, "updated_at" = ? WHERE "user_wines"."id" = ?  [["rating", 3], ["updated_at", "2018-01-02 03:36:43.817738"], ["id", 1]]
UPDATE "wines" SET "year" = ?, "updated_at" = ? WHERE "wines"."id" = ?  [["year", 1989], ["updated_at", "2018-01-01 23:41:18.073666"], ["id", 17]]