app/views/wines/show.html.erb

SELECT "recipes".* FROM "recipes" INNER JOIN "wine_recipes" ON "recipes"."id" = "wine_recipes"."recipe_id" WHERE "wine_recipes"."wine_id" = ?  [["wine_id", 1]]
---

<ul> <% @wine.recipes.each do |recipe| %>

SELECT  "user_wines".* FROM "user_wines" WHERE "user_wines"."wine_id" = 27 AND "user_wines"."user_id" = 5 LIMIT ?  [["LIMIT", 1]]
---
<% end %> </ul>
<% if !@user.user_wines.find_by(wine: @wine) %>